



var cart_div = document.querySelector(".carts_products div");
let news = document.querySelector("[data-preaload]");

window.addEventListener("load", function () {
    news.classList.add("loaded");
});



let head = document.querySelector('#data_head')
let srolling = 0

function scrool() {
    let isScrollBottom = srolling < window.scrollY
    if (isScrollBottom) {
        head.classList.add("hide")
    }
    else {
        head.classList.remove("hide")
    }
    srolling = window.scrollY;
}

window.addEventListener("scroll", function () {
    // if (window.innerWidth <= 985) {
    //     return 0
    // }
    if (window.scrollY >= 50) {
        head.classList.add("active");
        scrool()
    } else {

        head.classList.remove("active")
    }
});
///////////////////////////////////////////////////////////////////////



















let volanteer100 = document.querySelector('.voolanter_bage_sec2');
let input_volanteer = document.querySelector('#input_volanteer');


let volanteers = [

    {
        id2: 1,
        id:11111 ,
        image: "./images/volanteer/marim.jpg",
        name: "مريم علاء",
        job: "طالب جامعي",
        universty: " تجاره ",
        age: "21",
        email: "mariemshokry737@gmail.com",
        dipartment: "مدير المتطوعين",
        hobby: "   الرسم",
        bragraph: "  مريم علاء هي مديرة المتطوعين في فريقنا، وتعتبر من الشخصيات القيادية البارزة. تتمتع بخبرة واسعة في مجال العمل التطوعي وتتميز بروح المبادرة والإبداع. مريم لديها قدرة فائقة على تنظيم الفعاليات وإدارة الفرق، مما يجعلها عنصرًا أساسيًا في تحقيق أهداف الفريق. بفضل تفانيها والتزامها، ساهمت في نجاح العديد من المبادرات التي تهدف إلى خدمة المجتمع وتعزيز التنمية المستدامة.  ",
    },
    {
        id2: 2,
        id: 22222,
        image: "./images/volanteer/rokaia.jpg",
        name: "رقيه محمد",
        job: "طالب جامعي",
        universty: "حقوق",
        age: "20",
        email: "roqia7223@gmail.com",
        dipartment: " PR",
        hobby: " القراءه والسفر",
        bragraph: " رقيه هي واحدة من المتطوعين المميزين في فريقنا، وتتميز بروحها المرحة وحبها الكبير للناس. دائمًا ما تنشر البهجة والإيجابية بين الجميع، مما يجعل العمل معها ممتعًا ومليئًا بالحيوية. رقيه لديها قدرة رائعة على التواصل والتفاعل مع الآخرين، وتساهم بشكل كبير في تعزيز روح الفريق والتعاون. بفضل شخصيتها المحبوبة وتفانيها، تساهم في نجاح العديد من المبادرات التي تهدف إلى خدمة المجتمع وتعزيز التنمية المستدامة.    ",
    },
    {
        id2: 4,
        id: 55555,
        image: "./images/volanteer/meme.jpg",
        name: "محمد ماجد",
        job: "طالب جامعي",
        universty: "حاسبات",
        age: "20",
        email: "mhmdmajdmhmd98@gmail.com",
        dipartment:"media",
        hobby: " القراءة،  الرياضة",
        bragraph: " محمد ماجد هو أحد الأعضاء البارزين في فريقنا، ويتميز بذكائه الحاد وطيبته الكبيرة. دائمًا ما يكون مستعدًا لمساعدة الآخرين وخدمة المجتمع بكل تفانٍ وإخلاص. محمد يتمتع بروح التعاون والجدعنة، مما يجعله شخصًا محبوبًا ومؤثرًا بين زملائه. بفضل قدراته الفريدة وتفانيه، يساهم بشكل كبير في نجاح العديد من المبادرات التي تهدف إلى تحسين المجتمع وتعزيز التنمية المستدامة.    ",
    },
    
    {
        id2: 3,
        id: 33333,
        image: "./images/volanteer/moataz.jpg",
        name: "معتز يحي",
        job: "طالب جامعي",
        universty: "حقوق",
        age: "20",
        email: "moatazyehia154@gmail.com",
        dipartment: " اجتماعيه",
        hobby: " الشطرنج ,تعلم اللغات,مشاهدة الأفلام و المسلسلات",
        bragraph: "  معتز هو أحد الأعضاء المميزين في فريقنا، ويتميز بلباقته في الكلام وقدرته على التواصل بفعالية مع الجميع. دائمًا ما يكون مستعدًا لمساعدة الآخرين وتقديم الدعم بكل تفانٍ وإخلاص. معتز يتمتع بروح التعاون والخدمة، مما يجعله شخصًا محبوبًا ومؤثرًا بين زملائه. بفضل شخصيته اللبقة وتفانيه، يساهم بشكل كبير في نجاح العديد من المبادرات التي تهدف إلى خدمة المجتمع وتعزيز التنمية المستدامة.  ",
    },
    {
        id2: 5,
        id: 66666,
        image: "./images/volanteer/wa3d.jpg",
        name: " وعد الله اشرف",
        job: "طالب جامعي",
        universty: "اقتصاد منزلي",
        age: "19",
        email: "waadashraf202020@gmail.com",
        dipartment: " AC",
        hobby: " الرسم ,الديكور الهاند ميد ",
        bragraph: "  وعد هي واحدة من المتطوعين النشطين في فريقنا، وتتميز بمشاركتها الفعالة في العديد من الأعمال التطوعية. دائمًا ما تكون لبقة في الكلام وتتمتع بقدرة رائعة على التواصل مع الآخرين. وعد تساهم بشكل كبير في تعزيز روح الفريق والتعاون، مما يجعلها عنصرًا أساسيًا في نجاح المبادرات التي تهدف إلى خدمة المجتمع وتحقيق التنمية المستدامة. بفضل تفانيها ولباقتها، تترك وعد أثرًا إيجابيًا في كل فعالية تشارك فيها.   ",
    },
    {
        id2: 6,
        id: 77777,
        image: "./images/volanteer/ebrahim.jpg",
        name: "   إبراهيم أحمد",
        job: "طالب جامعي",
        universty: "  علوم الرياضة ",
        age: "21 ",
        email: "brhomahelal@gmail.com",
        dipartment: " HR",
        hobby: " الرسم ,  مشاهده الافلام و المسلسلات ,الطبخ ",
        bragraph: "  إبراهيم هو أحد الأعضاء المميزين في فريقنا، ويتميز بتفانيه الكبير وروحه الإيجابية. دائمًا ما يكون مستعدًا لتقديم المساعدة والدعم للآخرين، مما يجعله شخصًا محبوبًا بين زملائه. إبراهيم يتمتع بقدرة رائعة على العمل الجماعي والتعاون، ويساهم بشكل كبير في نجاح المبادرات التي تهدف إلى خدمة المجتمع وتعزيز التنمية المستدامة. بفضل شخصيته الطيبة وتفانيه، يترك إبراهيم أثرًا إيجابيًا في كل فعالية يشارك فيها.   ",
    },

    {
        id2: 7,
        id: 88888,
        image: "./images/volanteer/ismail.jpg",
        name: "   اسماعيل حسين",
        job: "طالب جامعي",
        universty: " تجاره ",
        age: "21 ",
        email: "Ismailpatrek@gmail.com",
        dipartment: " PR",
        hobby: " كره قدم    ",
        bragraph: "  هذا الشخص هو أحد المتطوعين المميزين في فريقنا. لديه خبرة واسعة في مجال العمل التطوعي ويتميز بروح التعاون والمساعدة. شارك في العديد من الفعاليات والمبادرات التي تهدف إلى خدمة المجتمع وتحقيق التنمية المستدامة.    ",
    },

    {
        id2: 8,
        id: 99999,
        image: "./images/volanteer/omar.jpg",
        name: " عمر حمدان ",
        job: "طالب جامعي",
        universty: "  علوم الرياضة",
        age: "20 ",
        email: "omarheman6060@gmail.com",
        dipartment: " HR",
        hobby: "الرسم,مونتاج ,صناعه المحتوي ,الرياضة ",
        bragraph: "  هذا الشخص هو أحد المتطوعين المميزين في فريقنا. لديه خبرة واسعة في مجال العمل التطوعي ويتميز بروح التعاون والمساعدة. شارك في العديد من الفعاليات والمبادرات التي تهدف إلى خدمة المجتمع وتحقيق التنمية المستدامة.    ",
    },
    {
        id2: 9,
        id: 21864,
        image: "./images/volanteer/manar atif.jpg",
        name: " منار عاطف ",
        job: "طالب جامعي",
        universty: "  تجاره ",
        age: "21 ",
        email: "manar.a.alwani@gmail.com",
        dipartment: " OC ",
        hobby: "سباحه ، عجل ",
        bragraph: " منار هي واحدة من الأعضاء البارزين في فريقنا، وتتميز بتفانيها الكبير وروحها الإيجابية. دائمًا ما تكون مستعدة لتقديم المساعدة والدعم للآخرين، مما يجعلها شخصًا محبوبًا بين زملائها. منار تتمتع بقدرة رائعة على العمل الجماعي والتعاون، وتسهم بشكل كبير في نجاح المبادرات التي تهدف إلى خدمة المجتمع وتعزيز التنمية المستدامة. بفضل شخصيتها الطيبة وتفانيها، تترك منار أثرًا إيجابيًا في كل فعالية تشارك فيها.  ",
    },
    {
        id2: 10,
        id: 10105,
        image: "./images/volanteer/mohamed waal.jpeg",
        name: " محمد وائل",
        job: "طالب جامعي",
        universty: "  تكنولوجيا العلوم الصحيه التطبيقيه ",
        age: "20 ",
        email: "midowaell@gnail.com",
        dipartment: " Media",
        hobby: "كره القدم ",
        bragraph: "  هذا الشخص هو أحد المتطوعين المميزين في فريقنا. لديه خبرة واسعة في مجال العمل التطوعي ويتميز بروح التعاون والمساعدة. شارك في العديد من الفعاليات والمبادرات التي تهدف إلى خدمة المجتمع وتحقيق التنمية المستدامة.    ",
    },
    {
        id2: 11,
        id: 75714,
        image: "./images/volanteer/ritage.jpg",
        name: "رتاج محمد ",
        job: "طالب جامعي",
        universty: "   خدمه اجتماعيه ",
        age: "19 ",
        email: "rerea9824@gmail.com",
        dipartment: " HR",
        hobby: "الرسم",
        bragraph: "  هذا الشخص هو أحد المتطوعين المميزين في فريقنا. لديه خبرة واسعة في مجال العمل التطوعي ويتميز بروح التعاون والمساعدة. شارك في العديد من الفعاليات والمبادرات التي تهدف إلى خدمة المجتمع وتحقيق التنمية المستدامة.    ",
    },
    {
        id2: 12,
        id: 71681,
        image: "./images/volanteer/noran.jpg",
        name: " نوران محمد",
        job: "طالب جامعي",
        universty: "   خدمه اجتماعيه ",
        age: "19 ",
        email: "noranm717@gmail.com",
        dipartment: " HR",
        hobby: "سباحه",
        bragraph: "  نوران هي واحدة من الأعضاء المميزين في فريقنا، وتتميز بقلبها الطيب ولباقتها في التعامل مع الآخرين. دائمًا ما تكون مستعدة لتقديم المساعدة والمشاركة في الأعمال الخيرية، مما يجعلها شخصًا محبوبًا ومؤثرًا بين زملائها. نوران تتمتع بروح التعاون وحب الخير، وتسهم بشكل كبير في نجاح المبادرات التي تهدف إلى خدمة المجتمع وتعزيز التنمية المستدامة. بفضل شخصيتها الطيبة وتفانيها، تترك نوران أثرًا إيجابيًا في كل فعالية تشارك فيها.   ",
    },
    {
        id2: 13,
        id: 16076,
        image: "./images/volanteer/gamal.jpg",
        name: " جمال محمد",
        job: "طالب جامعي",
        universty: "   خدمه اجتماعيه ",
        age: "19 ",
        email: "gamalmuhamed765@gmail.com",
        dipartment: " HR",
        hobby: "سباحه",
        bragraph: "  هذا الشخص هو أحد المتطوعين المميزين في فريقنا. لديه خبرة واسعة في مجال العمل التطوعي ويتميز بروح التعاون والمساعدة. شارك في العديد من الفعاليات والمبادرات التي تهدف إلى خدمة المجتمع وتحقيق التنمية المستدامة.    ",
    },

    {
        id2: 14,
        id: 39612,
        image: "./images/volanteer/Mariam Mazeed.jpg",
        name: " مريم محمد",
        job: "طالب جامعي",
        universty: "   خدمه اجتماعيه ",
        age: "19 ",
        email: "mmazeed007@gmail.com",
        dipartment: " PR",
        hobby: "Handcraft , swimming, domino ",
        bragraph: "  هذا الشخص هو أحد المتطوعين المميزين في فريقنا. لديه خبرة واسعة في مجال العمل التطوعي ويتميز بروح التعاون والمساعدة. شارك في العديد من الفعاليات والمبادرات التي تهدف إلى خدمة المجتمع وتحقيق التنمية المستدامة.    ",
    },
    {
        id2: 15,
        id: 50189,
        image: "./images/volanteer/Ahmad W.jpg",
        name: "أحمد وليد",
        job: "طالب جامعي",
        universty: " فنون جميله",
        age: "19 ",
        email: "ahmed1waleed.18@gmail.com",
        dipartment: " PR",
        hobby: "الرسم ,لعب سكرو  ",
        bragraph: "  هذا الشخص هو أحد المتطوعين المميزين في فريقنا. لديه خبرة واسعة في مجال العمل التطوعي ويتميز بروح التعاون والمساعدة. شارك في العديد من الفعاليات والمبادرات التي تهدف إلى خدمة المجتمع وتحقيق التنمية المستدامة.    ",
    },
    {
        id2: 16,
        id: 57394,
        image: "./images/volanteer/7oda tamer74.jpg",
        name: "محمود تامر",
        job: "طالب جامعي",
        universty: " خدمه اجتماعيه",
        age: "21 ",
        email: "7odatamer74@gmail.com",
        dipartment: " VICE HEAD OF AC",
        hobby: "سباحه وكره قدم ",
        bragraph: "  هذا الشخص هو أحد المتطوعين المميزين في فريقنا. لديه خبرة واسعة في مجال العمل التطوعي ويتميز بروح التعاون والمساعدة. شارك في العديد من الفعاليات والمبادرات التي تهدف إلى خدمة المجتمع وتحقيق التنمية المستدامة.    ",
    },

    {
        id2: 17,
        id: 91797,
        image: "./images/volanteer/Mariam Abbas.jpg",
        name: "مريم ابو العباس",
        job: "طالب جامعي",
        universty: " فنون جميله ",
        age: "20 ",
        email: "mariamabbas161004@gmail.com",
        dipartment: "Hr",
        hobby: " Graphic Designer + Digital Artist",
        bragraph: "  هذا الشخص هو أحد المتطوعين المميزين في فريقنا. لديه خبرة واسعة في مجال العمل التطوعي ويتميز بروح التعاون والمساعدة. شارك في العديد من الفعاليات والمبادرات التي تهدف إلى خدمة المجتمع وتحقيق التنمية المستدامة.    ",
    },
    {
        id2: 18,
        id: 82473,
        image: "./images/volanteer/Team Games.jpg",
        name: "عبدالله مجدي",
        job: "طالب جامعي",
        universty: " الحقوق ",
        age: "20 ",
        email: "Abdullahmagdisaad@gmail.com ",
        dipartment: "Activities ",
        hobby: " كره القدم ",
        bragraph: "  هذا الشخص هو أحد المتطوعين المميزين في فريقنا. لديه خبرة واسعة في مجال العمل التطوعي ويتميز بروح التعاون والمساعدة. شارك في العديد من الفعاليات والمبادرات التي تهدف إلى خدمة المجتمع وتحقيق التنمية المستدامة.    ",
    },
    {
        id2: 19,
        id: 24568,
        image: "./images/volanteer/mariam.jpg",
        name: "مريم خالد",
        job: "طالب جامعي",
        universty: " الخدمه الاجتماعيه ",
        age: "20 ",
        email: "mariamkhaledelseeht@gmail.com ",
        dipartment: "HR ",
        hobby: " القراءه، التعامل مع الناس، الكتابه، ",
        bragraph: "  هذا الشخص هو أحد المتطوعين المميزين في فريقنا. لديه خبرة واسعة في مجال العمل التطوعي ويتميز بروح التعاون والمساعدة. شارك في العديد من الفعاليات والمبادرات التي تهدف إلى خدمة المجتمع وتحقيق التنمية المستدامة.    ",
    },

    {
        id2: 20,
        id: 63009,
        image: "./images/volanteer/zina.png",
        name: "زينة محمد",
        job: "طالب جامعي",
        universty: " الخدمه الاجتماعيه ",
        age: "20 ",
        email: "zeina2112005@gmail.com ",
        dipartment: "PR ",
        hobby: " القراءه، الرسم، الكتابه ",
        bragraph: "  هذا الشخص هو أحد المتطوعين المميزين في فريقنا. لديه خبرة واسعة في مجال العمل التطوعي ويتميز بروح التعاون والمساعدة. شارك في العديد من الفعاليات والمبادرات التي تهدف إلى خدمة المجتمع وتحقيق التنمية المستدامة.    ",
    },
    // {
    //     id2: 21,
    //     id: 60658,
    //     image: "./images/volanteer/Shahd Refaat.jpeg",
    //     name:"شهد رفعت ",
    //     job: "طالب جامعي",
    //     universty: "  سياحه وفنادق ",
    //     age: "20 ",
    //     email: "Shahdrefaatrefaat@gmail .com",
    //     dipartment: "Hr ",
    //     hobby: " الرسم والقراءة ",
    //     bragraph: "  هذا الشخص هو أحد المتطوعين المميزين في فريقنا. لديه خبرة واسعة في مجال العمل التطوعي ويتميز بروح التعاون والمساعدة. شارك في العديد من الفعاليات والمبادرات التي تهدف إلى خدمة المجتمع وتحقيق التنمية المستدامة.    ",
    // },
    // {
    //     id2: 22,
    //     id: 88585,
    //     image: "./images/volanteer/Malak Magdy.jpg",
    //     name:" ملك مجدي  ",
    //     job: "طالب جامعي",
    //     universty: " اقتصاد منزلي ",
    //     age: "19 ",
    //     email: "malakmagdibadra@gmail.com",
    //     dipartment: "Pr ",
    //     hobby: " باسكت رسم زراعه ",
    //     bragraph: "  هذا الشخص هو أحد المتطوعين المميزين في فريقنا. لديه خبرة واسعة في مجال العمل التطوعي ويتميز بروح التعاون والمساعدة. شارك في العديد من الفعاليات والمبادرات التي تهدف إلى خدمة المجتمع وتحقيق التنمية المستدامة.    ",
    // },
    {
        id2: 23,
        id: 81234,
        image: "./images/volanteer/farah.jpg",
        name:" فرح محمد ",
        job: "طالب جامعي",
        universty: " خدمة اجتماعية ",
        age: "20 ",
        email: "farahmohamedamin89@gmail.com",
        dipartment: "Oc ",
        hobby: "  تصوير وسفر",
        bragraph: "  هذا الشخص هو أحد المتطوعين المميزين في فريقنا. لديه خبرة واسعة في مجال العمل التطوعي ويتميز بروح التعاون والمساعدة. شارك في العديد من الفعاليات والمبادرات التي تهدف إلى خدمة المجتمع وتحقيق التنمية المستدامة.    ",
    },
    {
        id2: 24,
        id: 73928,
        image: "./images/volanteer/Mariam Amr.jpg",
        name:" مريم عمرو",
        job: "طالب جامعي",
        universty: " خدمة اجتماعية ",
        age: "19 ",
        email: "mariam.amr.taha16@gmail.com",
        dipartment: "Head OC ",
        hobby: "  تصوير وسفر الرياضه ( مسافات طويله ) + الكروشيه ",
        bragraph: "  مريم هي قائدة فريق OC وتتميز بقلبها الطيب وروحها المتعاونة. دائمًا ما تكون مستعدة لتقديم الدعم والمساعدة للجميع، مما يجعلها شخصية محبوبة ومؤثرة في الفريق. بفضل قيادتها الحكيمة وتفانيها، تسهم مريم بشكل كبير في نجاح الفعاليات والمبادرات التي تهدف إلى خدمة المجتمع وتعزيز التنمية المستدامة.   ",
    },
    // {
    //     id2: 25,
    //     id: 30041,
    //     image: "./images/volanteer/Eman Hussen2.jpg",
    //     name:" ايمان حسين",
    //     job: "طالب جامعي",
    //     universty: " التجاره واداره الأعمال ",
    //     age: "20 ",
    //     email: "emanhussein303@gmail.com",
    //     dipartment: "Pr ",
    //     hobby: " القراءه و السباحه",
    //     bragraph: "  هذا الشخص هو أحد المتطوعين المميزين في فريقنا. لديه خبرة واسعة في مجال العمل التطوعي ويتميز بروح التعاون والمساعدة. شارك في العديد من الفعاليات والمبادرات التي تهدف إلى خدمة المجتمع وتحقيق التنمية المستدامة.    ",
    // },
    // {
    //     id2: 26,
    //     id: 72985,
    //     image: "./images/volanteer/fatma mahmoud2.jpg",
    //     name:"  فاطمه محمود ",
    //     job: "طالب جامعي",
    //     universty: " التجاره واداره الأعمال ",
    //     age: "20 ",
    //     email: "fm590899@gmail.com",
    //     dipartment: "Pr ",
    //     hobby: " القراءه و السباحه",
    //     bragraph: "  هذا الشخص هو أحد المتطوعين المميزين في فريقنا. لديه خبرة واسعة في مجال العمل التطوعي ويتميز بروح التعاون والمساعدة. شارك في العديد من الفعاليات والمبادرات التي تهدف إلى خدمة المجتمع وتحقيق التنمية المستدامة.    ",
    // },
    {
        id2: 27,
        id: 46035,
        image: "./images/volanteer/Roaa Shehata.jpg",
        name:"  رؤى شحاته",
        job: "طالب جامعي",
        universty: " التجاره واداره الأعمال ",
        age: "20 ",
        email: "roaashehata49@gmail.com",
        dipartment: "Head of OC  ",
        hobby: " القراءه  ",
        bragraph: " رؤى هي قائدة فريق OC وتتميز بحزمها في العمل وقدرتها على إدارة الفريق بكفاءة عالية. دائمًا ما تكون حازمة في اتخاذ القرارات وتنظيم الفعاليات، مما يضمن تحقيق الأهداف بكفاءة. بالإضافة إلى ذلك، رؤى تتمتع بقلب طيب وروح متعاونة، مما يجعلها شخصية محبوبة بين زملائها. بفضل قيادتها الحكيمة وتفانيها، تسهم رؤى بشكل كبير في نجاح المبادرات التي تهدف إلى خدمة المجتمع وتعزيز التنمية المستدامة.    ",
    },
    {
        id2: 28,
        id: 45230,
        image: "./images/volanteer/Naden Mustafa.jpg",
        name:"   نادين مصطفى",
        job: "طالب جامعي",
        universty: " خدمه اجتماعيه ",
        age: "19 ",
        email: "nadenmostafa2005@gmail.com",
        dipartment: "Pr ",
        hobby: " رسم  ",
        bragraph: "  نادين هي قائدة لجنة العلاقات العامة (PR) في فريقنا، وتتميز بقدرتها الفائقة على التواصل الفعّال وبناء العلاقات مع الجميع. دائمًا ما تكون مستعدة لتقديم الدعم والمساعدة، مما يجعلها شخصية محبوبة ومؤثرة بين زملائها. بفضل قيادتها الحكيمة وتفانيها، تسهم نادين بشكل كبير في نجاح المبادرات التي تهدف إلى تعزيز صورة الفريق وتحقيق التنمية المستدامة.    ",
    },
    {
        id2: 29,
        id: 76996,
        image: "./images/volanteer/Mariam Medhat.jpg",
        name:"    مريم مدحت",
        job: "طالب جامعي",
        universty: " اقتصاد منزلي ",
        age: "20 ",
        email: "maryammedhat26@gmail.com",
        dipartment: "Pr ",
        hobby: " رسم و حرف يدويه   ",
        bragraph: "  هذا الشخص هو أحد المتطوعين المميزين في فريقنا. لديه خبرة واسعة في مجال العمل التطوعي ويتميز بروح التعاون والمساعدة. شارك في العديد من الفعاليات والمبادرات التي تهدف إلى خدمة المجتمع وتحقيق التنمية المستدامة.    ",
    },
    // {
    //     id2: 30,
    //     id: 69538,
    //     image: "./images/volanteer/Hala Mohamed2.jpg",
    //     name:"    هالة محمد",
    //     job: "طالب جامعي",
    //     universty: "  آداب ",
    //     age: "20 ",
    //     email: "Chala.2005.10@gmail.com",
    //     dipartment: "Hr ",
    //     hobby: " كاراتيه   ",
    //     bragraph: "  هذا الشخص هو أحد المتطوعين المميزين في فريقنا. لديه خبرة واسعة في مجال العمل التطوعي ويتميز بروح التعاون والمساعدة. شارك في العديد من الفعاليات والمبادرات التي تهدف إلى خدمة المجتمع وتحقيق التنمية المستدامة.    ",
    // },
    {
        id2: 31,
        id: 72292,
        image: "./images/volanteer/Nour Hassan.jpg",
        name:"     نور حسن ",
        job: "طالب جامعي",
        universty: "  الخدمة الاجتماعية  ",
        age: "19 ",
        email: "nour482005@gmail.com",
        dipartment: "OC ",
        hobby: " الرسم والتمثيل   ",
        bragraph: "  هذا الشخص هو أحد المتطوعين المميزين في فريقنا. لديه خبرة واسعة في مجال العمل التطوعي ويتميز بروح التعاون والمساعدة. شارك في العديد من الفعاليات والمبادرات التي تهدف إلى خدمة المجتمع وتحقيق التنمية المستدامة.    ",
    },
    {
        id2: 32,
        id: 14509,
        image: "./images/volanteer/Basem Hany.jpg",
        name:"      باسم هاني  ",
        job: "طالب جامعي",
        universty: " حقوق ",
        age: "22 ",
        email: "hbasem308@gmail.com",
        dipartment: "Pr ",
        hobby: " سباحه _ بوكسينغ ",
        bragraph: "  هذا الشخص هو أحد المتطوعين المميزين في فريقنا. لديه خبرة واسعة في مجال العمل التطوعي ويتميز بروح التعاون والمساعدة. شارك في العديد من الفعاليات والمبادرات التي تهدف إلى خدمة المجتمع وتحقيق التنمية المستدامة.    ",
    },
    // {
    //     id2: 33,
    //     id: 14036,
    //     image: "./images/volanteer/Alaa Shawky.jpg",
    //     name:"      الاء شوقى",
    //     job: "طالب جامعي",
    //     universty: " تربية رياضية  ",
    //     age: "20 ",
    //     email: "alaashawky2792005@gmail.com",
    //     dipartment: "Pr/Ac  ",
    //     hobby: " الرسم ",
    //     bragraph: "  هذا الشخص هو أحد المتطوعين المميزين في فريقنا. لديه خبرة واسعة في مجال العمل التطوعي ويتميز بروح التعاون والمساعدة. شارك في العديد من الفعاليات والمبادرات التي تهدف إلى خدمة المجتمع وتحقيق التنمية المستدامة.    ",
    // },

    {
        id2: 34,
        id: 54623,
        image: "./images/volanteer/mohamed ahmed.jpeg",
        name:"     محمد احمد",
        job: "طالب جامعي",
        universty: " تجاره انجلش",
        age: "20 ",
        email: "power.dodom@gmail.com",
        dipartment: "HR ",
        hobby: " البوكس , رفع الاثقال , قراءه الكتب ,البيانه , كره القدم  ",
        bragraph: "  هذا الشخص هو أحد المتطوعين المميزين في فريقنا. لديه خبرة واسعة في مجال العمل التطوعي ويتميز بروح التعاون والمساعدة. شارك في العديد من الفعاليات والمبادرات التي تهدف إلى خدمة المجتمع وتحقيق التنمية المستدامة.    ",
    },
  
    {
        id2: 35,
        id: 18693,
        image: "./images/volanteer/Sama Youssef.jpg",
        name:"      سما يوسف",
        job: "طالب جامعي",
        universty: " تربيه فنيه ",
        age: "20 ",
        email: "samayoussef906@gmail.com",
        dipartment: "ميديا ",
        hobby: "رسم ",
        bragraph: "  هذا الشخص هو أحد المتطوعين المميزين في فريقنا. لديه خبرة واسعة في مجال العمل التطوعي ويتميز بروح التعاون والمساعدة. شارك في العديد من الفعاليات والمبادرات التي تهدف إلى خدمة المجتمع وتحقيق التنمية المستدامة.    ",
    },
    
    {
        id2: 36,
        id: 44444,
        image: "./images/volanteer/Salah Swelam.jpg",
        name:"     صلاح سويلم",
        job: "طالب جامعي",
        universty: " تجارة",
        age: "20 ",
        email: "salahswelam21@gmail.com",
        dipartment: "Pr ",
        hobby: "Meditation ",
        bragraph: "  صلاح سويلم هو أحد الأعضاء المميزين في فريقنا، ويتميز بأناقته وحبه الكبير للتصوير. دائمًا ما يكون مستعدًا لالتقاط أجمل اللحظات وتوثيقها بعدسته المبدعة. بالإضافة إلى ذلك، صلاح هو مساعد قائد شاطر، يتمتع بقدرة فائقة على التنظيم والتنسيق، مما يجعله عنصرًا أساسيًا في نجاح الفريق. بفضل شخصيته الأنيقة وتفانيه، يترك صلاح أثرًا إيجابيًا في كل فعالية يشارك فيها.   ",
    },
    {
        id2: 37,
        id: 74170,
        image: "./images/volanteer/Zakaria Tamer.jpeg",
        name:"     زكريا تامر",
        job: "طالب جامعي",
        universty: " تجارة",
        age: "20 ",
        email: "zakariatamer914@gmail.com",
        dipartment: "تنظيم  ",
        hobby: "كره القدم ",
        bragraph: "  هذا الشخص هو أحد المتطوعين المميزين في فريقنا. لديه خبرة واسعة في مجال العمل التطوعي ويتميز بروح التعاون والمساعدة. شارك في العديد من الفعاليات والمبادرات التي تهدف إلى خدمة المجتمع وتحقيق التنمية المستدامة.    ",
    },
    {
        id2: 38,
        id: 56067,
        image: "./images/volanteer/Caroline Fares.jpg",
        name:"    كارولين فارس ",
        job: "طالب جامعي",
        universty: " تجارة",
        age: "24 ",
        email: "Carolinefares119@gmail.com",
        dipartment: "pr  ",
        hobby: "  الغني/ الجري  ",
        bragraph: "  هذا الشخص هو أحد المتطوعين المميزين في فريقنا. لديه خبرة واسعة في مجال العمل التطوعي ويتميز بروح التعاون والمساعدة. شارك في العديد من الفعاليات والمبادرات التي تهدف إلى خدمة المجتمع وتحقيق التنمية المستدامة.    ",
    },
    {
        id2: 39,
        id: 49978,
        image: "./images/volanteer/Amr AbdelGhani.jpeg",
        name:"    عمرو عبدالغني",
        job: "طالب جامعي",
        universty: " الاداب",
        age: "19 ",
        email: "amrb0141@gmail.com",
        dipartment: "pr  ",
        hobby: " كورة القدم  ",
        bragraph: "  هذا الشخص هو أحد المتطوعين المميزين في فريقنا. لديه خبرة واسعة في مجال العمل التطوعي ويتميز بروح التعاون والمساعدة. شارك في العديد من الفعاليات والمبادرات التي تهدف إلى خدمة المجتمع وتحقيق التنمية المستدامة.    ",
    },
    {
        id2: 40,
        id: 37332,
        image: "./images/volanteer/haidi.jpg",
        name:"    هايدي تامر",
        job: "طالب جامعي",
        universty: "  تجاره وإدارة الأعمال ",
        age: "21 ",
        email: "haidytamer74@gmail.com",
        dipartment: "Vice head of Hr  ",
        hobby: " اسكيت  ",
        bragraph: "  هذا الشخص هو أحد المتطوعين المميزين في فريقنا. لديه خبرة واسعة في مجال العمل التطوعي ويتميز بروح التعاون والمساعدة. شارك في العديد من الفعاليات والمبادرات التي تهدف إلى خدمة المجتمع وتحقيق التنمية المستدامة.    ",
    },
    {
        id2: 41,
        id: 11848,
        image: "./images/volanteer/hagar.jpg",
        name:"    هاجر عنتر",
        job: "طالب جامعي",
        universty: "  الحقوق ",
        age: "19 ",
        email: "hageranter83111@gmail.com",
        dipartment: "OC ",
        hobby: " السفر _ القراءة  ",
        bragraph: "  هاجر هي واحدة من الأعضاء المميزين في فريقنا، وتتميز بتفانيها وروحها الإيجابية. دائمًا ما تكون مستعدة لتقديم المساعدة والدعم للآخرين، مما يجعلها شخصية محبوبة بين زملائها. هاجر تتمتع بقدرة رائعة على العمل الجماعي والتعاون، وتسهم بشكل كبير في نجاح المبادرات التي تهدف إلى خدمة المجتمع وتعزيز التنمية المستدامة. بفضل شخصيتها الطيبة وتفانيها، تترك هاجر أثرًا إيجابيًا في كل فعالية تشارك فيها.   ",
    },
    
    {
        id2: 42,
        id: 21020,
        image: "./images/volanteer/Kareem Mohamed.jpg",
        name:"   كريم محمد",
        job: "طالب جامعي",
        universty: "  تكنولوجيا  ",
        age: "20 ",
        email: "kareemmohamedmahf20@gmail.com",
        dipartment: "Pr ",
        hobby: " التصوير و العربيات  ",
        bragraph: "  هذا الشخص هو أحد المتطوعين المميزين في فريقنا. لديه خبرة واسعة في مجال العمل التطوعي ويتميز بروح التعاون والمساعدة. شارك في العديد من الفعاليات والمبادرات التي تهدف إلى خدمة المجتمع وتحقيق التنمية المستدامة.    ",
    },

    {
        id2: 43,
        id: 15845,
        image: "./images/volanteer/Salma esmail.jpg",
        name:"  سلمى اسماعيل",
        job: "طالب جامعي",
        universty: "  خدمه اجتماعيه  ",
        age: "19 ",
        email: "Yasmienesmail1995@gmail.com",
        dipartment: "Hr ",
        hobby: " التصوير والقرأه ",
        bragraph: "  هذا الشخص هو أحد المتطوعين المميزين في فريقنا. لديه خبرة واسعة في مجال العمل التطوعي ويتميز بروح التعاون والمساعدة. شارك في العديد من الفعاليات والمبادرات التي تهدف إلى خدمة المجتمع وتحقيق التنمية المستدامة.    ",
    },
    {
        id2: 44,
        id: 46054,
        image: "./images/volanteer/Sarah El-bastawesy.jpg",
        name:"  سارة محمد ",
        job: "طالب جامعي",
        universty: "  الآداب علم النفس ",
        age: "20 ",
        email: "Sarah.elbastawesyy@gmail.com",
        dipartment: "Pr ",
        hobby: " القراءة و الموسيقى ",
        bragraph: "  هذا الشخص هو أحد المتطوعين المميزين في فريقنا. لديه خبرة واسعة في مجال العمل التطوعي ويتميز بروح التعاون والمساعدة. شارك في العديد من الفعاليات والمبادرات التي تهدف إلى خدمة المجتمع وتحقيق التنمية المستدامة.    ",
    },
    {
        id2: 45,
        id: 77576,
        image: "./images/volanteer/HöØşȚëŠș Ęşřäå.jpg",
        name:" إسراء خالد ",
        job: "طالب جامعي",
        universty: "  تجارة",
        age: "21 ",
        email: "ek73257@gmail.com",
        dipartment: "Pr ",
        hobby: " القراءة، التصميم، اشغال يدوية، السفر",
        bragraph: "  هذا الشخص هو أحد المتطوعين المميزين في فريقنا. لديه خبرة واسعة في مجال العمل التطوعي ويتميز بروح التعاون والمساعدة. شارك في العديد من الفعاليات والمبادرات التي تهدف إلى خدمة المجتمع وتحقيق التنمية المستدامة.    ",
    },
    {
        id2: 46,
        id: 70061,
        image: "./images/volanteer/Haneen Hamada.jpg",
        name:" حنين حماده ",
        job: "طالب جامعي",
        universty: "  التربيه الفنيه ",
        age: "19 ",
        email: "haneenhamada1511@gmail.com",
        dipartment: "Ac ",
        hobby: " الرسم",
        bragraph: "  هذا الشخص هو أحد المتطوعين المميزين في فريقنا. لديه خبرة واسعة في مجال العمل التطوعي ويتميز بروح التعاون والمساعدة. شارك في العديد من الفعاليات والمبادرات التي تهدف إلى خدمة المجتمع وتحقيق التنمية المستدامة.    ",
    },
    {
        id2: 47,
        id: 76649,
        image: "./images/volanteer/Malak Amr.jpg",
        name:" ملك عمرو",
        job: "طالب جامعي",
        universty: "  التربيه الفنيه ",
        age: "20 ",
        email: "mokatoty2004@gmail.com",
        dipartment: "Hr ",
        hobby: " الرسم",
        bragraph: "  هذا الشخص هو أحد المتطوعين المميزين في فريقنا. لديه خبرة واسعة في مجال العمل التطوعي ويتميز بروح التعاون والمساعدة. شارك في العديد من الفعاليات والمبادرات التي تهدف إلى خدمة المجتمع وتحقيق التنمية المستدامة.    ",
    },
    {
        id2: 48,
        id: 77307,
        image: "./images/volanteer/Mostafa Hany.jpg",
        name:" مصطفى هانى",
        job: "طالب جامعي",
        universty: "  تجاره ",
        age: "20 ",
        email: "mostafahany2219@gmail.com",
        dipartment: "Hr ",
        hobby: " كرة القدم وحب للالعاب الجيميمج ",
        bragraph: "  هذا الشخص هو أحد المتطوعين المميزين في فريقنا. لديه خبرة واسعة في مجال العمل التطوعي ويتميز بروح التعاون والمساعدة. شارك في العديد من الفعاليات والمبادرات التي تهدف إلى خدمة المجتمع وتحقيق التنمية المستدامة.    ",
    },
    {
        id2: 49,
        id: 72869,
        image: "./images/volanteer/Shahd Ahmed.jpg",
        name:" شهد أحمد",
        job: "طالب جامعي",
        universty: "  تجاره ",
        age: "20 ",
        email: "shahd.ahmedded@gmail.com",
        dipartment: "Oc ",
        hobby: " السباحه والقراءه ",
        bragraph: "  هذا الشخص هو أحد المتطوعين المميزين في فريقنا. لديه خبرة واسعة في مجال العمل التطوعي ويتميز بروح التعاون والمساعدة. شارك في العديد من الفعاليات والمبادرات التي تهدف إلى خدمة المجتمع وتحقيق التنمية المستدامة.    ",
    },
    {
        id2: 50,
        id: 26265,
        image: "./images/volanteer/fatima.jpg",
        name:" فاطمه ممدوح ",
        job: "طالب جامعي",
        universty: "  تربية رياضيه ",
        age: "21 ",
        email: "fatmtmmdwh52@gmail.com",
        dipartment: "... ",
        hobby: " عزف اورج ,تكوين المعدلات الكمياء,الباليه",
        bragraph: "  هذا الشخص هو أحد المتطوعين المميزين في فريقنا. لديه خبرة واسعة في مجال العمل التطوعي ويتميز بروح التعاون والمساعدة. شارك في العديد من الفعاليات والمبادرات التي تهدف إلى خدمة المجتمع وتحقيق التنمية المستدامة.    ",
    },
    {
        id2: 51,
        id: 20322,
        image: "./images/volanteer/may.jpg",
        name:" مي عبد الحليم",
        job: "طالب جامعي",
        universty: "  حقوق",
        age: "19 ",
        email: "maiandelhalim@gmail.com",
        dipartment: "oc ",
        hobby: " رسم",
        bragraph: "  هذا الشخص هو أحد المتطوعين المميزين في فريقنا. لديه خبرة واسعة في مجال العمل التطوعي ويتميز بروح التعاون والمساعدة. شارك في العديد من الفعاليات والمبادرات التي تهدف إلى خدمة المجتمع وتحقيق التنمية المستدامة.    ",
    },

    {
        id2: 52,
        id: 36541,
        image: "./images/volanteer/salma.jpg",
        name:" سلمى ناصر",
        job: "طالب جامعي",
        universty: "  اقتصاد منزلي",
        age: "19 ",
        email: "salmanaser2662@gmail.com",
        dipartment: "AC  ",
        hobby: " كرة سلة",
        bragraph: "  هذا الشخص هو أحد المتطوعين المميزين في فريقنا. لديه خبرة واسعة في مجال العمل التطوعي ويتميز بروح التعاون والمساعدة. شارك في العديد من الفعاليات والمبادرات التي تهدف إلى خدمة المجتمع وتحقيق التنمية المستدامة.    ",
    },

]




input_volanteer.addEventListener('keydown', function (event) {
    if (event.key === 'Enter') {

        news.classList.add("zip");
        let search = input_volanteer.value;
        console.log(search);
        // volanteer100.style.display = "block"
    
        let volanteer = volanteers.find(volanteer => volanteer.id === parseInt(search));
        if (volanteer) {
            let y = `
                <div class="voolanter_bage_sec_text1 col-10 col-md-5 mx-auto">
                    <div class="d-flex">
                        <div class="half_circle" data-aos="fade-up" data-aos-once="true"></div>
                        <h2 class="important" id="who" data-aos="fade-up" data-aos-once="true">${volanteer.name}</h2>
                    </div>
                    <br><br>
                    <div>
                        <p data-aos="fade-up" data-aos-once="true" data-aos-delay=50> ${volanteer.bragraph}  </p>
                        <ul>
                            <li  data-aos="fade-up" data-aos-once="true" data-aos-delay=60>العمر: ${volanteer.age} سنة</li>
                            <li  data-aos="fade-up" data-aos-once="true" data-aos-delay=70>المهنة: ${volanteer.job}</li>
                            
                            <li  data-aos="fade-up" data-aos-once="true" data-aos-delay=90> الكليه: ${volanteer.universty}</li>
                            <li  data-aos="fade-up" data-aos-once="true" data-aos-delay=100>الايميل: ${volanteer.email}</li>
                            <li  data-aos="fade-up" data-aos-once="true" data-aos-delay=100>اللجنه: ${volanteer.dipartment}</li>
                            <li  data-aos="fade-up" data-aos-once="true" data-aos-delay=80>الهوايات: ${volanteer.hobby}</li>
                        </ul>
                    </div>
                </div>
                <div class="voolanter_bage_sec_image col-10 col-md-5 mx-auto">
                    <div class="custom_box">
                        <img id="volunteerImage" src="${volanteer.image}" alt=""  data-aos="fade-up" data-aos-once="true" data-aos-delay=0 data-aos-duration="1500">
                    </div>
                </div>
            `;
            volanteer100.innerHTML = y;
            news.classList.remove("zip");
        } else {
            news.classList.remove("zip");
            volanteer100.innerHTML = "<h2>لا يوجد متطوع بهذا الرقم</h2>";

        }
    }
});
